edward62740/ot-HS/Code/HS/STM32_WPAN/App/app_thread.c
	/* Set Channel to 15 */
	aDataset.mChannel = 26;
	aDataset.mComponents.mIsChannelPresent = true;

	/* Set Pan ID to 2222 */
	aDataset.mPanId = (otPanId) 0xCCC1;
	aDataset.mComponents.mIsPanIdPresent = true;

	/* Set Extended Pan ID to  */
	uint8_t extPanId[OT_EXT_PAN_ID_SIZE] =
	{ 0x11, 0x11, 0x11, 0x11, 0x22, 0x22, 0x22, 0x22 };
	memcpy(aDataset.mExtendedPanId.m8, extPanId,
			sizeof(aDataset.mExtendedPanId));
	aDataset.mComponents.mIsExtendedPanIdPresent = true;

	/* Set network key to  */
	uint8_t key[OT_NETWORK_KEY_SIZE] =
	{ 0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF };
	memcpy(aDataset.mNetworkKey.m8, key, sizeof(aDataset.mNetworkKey));
	aDataset.mComponents.mIsNetworkKeyPresent = true;

	/* Set Network Name */
	size_t length = strlen(aNetworkName);
	assert(length <= OT_NETWORK_NAME_MAX_SIZE);
	memcpy(aDataset.mNetworkName.m8, aNetworkName, length);
	aDataset.mComponents.mIsNetworkNamePresent = true;
	/* Set the Active Operational Dataset to this dataset */
	error = otDatasetSetActive(sInstance, &aDataset);
	error = otIp6SetEnabled(sInstance, true);
	if (error != OT_ERROR_NONE)
	{
		APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
	}
	error = otThreadSetEnabled(sInstance, true);
	if (error != OT_ERROR_NONE)
	{
		APP_THREAD_Error(ERR_THREAD_START, error);
	}
	/* USER CODE BEGIN DEVICECONFIG */
	/* Start the COAP server */
	error = otCoapStart(sInstance, OT_DEFAULT_COAP_PORT);
	if (error != OT_ERROR_NONE)
	{
		APP_THREAD_Error(ERR_THREAD_COAP_START, error);
	}
	/* Add COAP resources */
	otCoapAddResource(sInstance, &OT_Ressource);

	/* USER CODE END DEVICECONFIG */
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(pContext);

	/* USER CODE BEGIN APP_THREAD_STATENOTIF */

	/* USER CODE END APP_THREAD_STATENOTIF */

	if ((NotifFlags & (uint32_t) OT_CHANGED_THREAD_ROLE)
			== (uint32_t) OT_CHANGED_THREAD_ROLE)
	{
		switch (otThreadGetDeviceRole(sInstance))
		{
		case OT_DEVICE_ROLE_DISABLED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */

			break;
		case OT_DEVICE_ROLE_DETACHED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */

			break;
		case OT_DEVICE_ROLE_CHILD:
			/* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
			HW_TS_Start(setThreadLpTimerId, (uint32_t) 1000);
			SHCI_C2_RADIO_AllowLowPower(THREAD_IP, TRUE);
			break;
		case OT_DEVICE_ROLE_ROUTER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
			HW_TS_Start(setThreadLpTimerId, (uint32_t) 1000);
			break;
		case OT_DEVICE_ROLE_LEADER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */

			break;
		default:
			/* USER CODE BEGIN DEFAULT */
			/* USER CODE END DEFAULT */
			break;
		}
	}
}

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *         the LEDs on the Board will start blinking.
 *
 * @param  pMess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_TraceError(const char *pMess, uint32_t ErrCode)
{
	/* USER CODE BEGIN TRACE_ERROR */
	APP_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);

	/* USER CODE END TRACE_ERROR */
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated information
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void)
{
	WirelessFwInfo_t wireless_info_instance;
	WirelessFwInfo_t *p_wireless_info = &wireless_info_instance;

	if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
	{
		APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS,
				(uint32_t) ERR_INTERFACE_FATAL);
	}
	else
	{
		APP_DBG("*****************WIRELESS COPROCESSOR FW*******************");
		/* Print version */
		APP_DBG("STACK VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor,
				p_wireless_info->VersionMinor, p_wireless_info->VersionSub);
		APP_DBG("Version release type: %d", p_wireless_info->VersionReleaseType);
		APP_DBG("Version branch type: %d", p_wireless_info->VersionBranch);
		APP_DBG("FUS VERSION ID = %d.%d.%d", p_wireless_info->FusVersionMajor,
				p_wireless_info->FusVersionMinor,
				p_wireless_info->FusVersionSub);
		APP_DBG("Stack type: %d", p_wireless_info->StackType);
		APP_DBG("MEMSIZE flash: %d", p_wireless_info->MemorySizeFlash);
		APP_DBG("MEMSIZE sram1: %d", p_wireless_info->MemorySizeSram1);
		APP_DBG("MEMSIZE sram2a: %d", p_wireless_info->MemorySizeSram2A);
		APP_DBG("MEMSIZE sram2b: %d", p_wireless_info->MemorySizeSram2B);
		switch (p_wireless_info->StackType)
		{
		case INFO_STACK_TYPE_THREAD_FTD:
			APP_DBG("FW Type : Thread FTD")
			;
			break;
		case INFO_STACK_TYPE_THREAD_MTD:
			APP_DBG("FW Type : Thread MTD")
			;
			break;
		case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC:
			APP_DBG("FW Type : Static Concurrent Mode BLE/Thread")
			;
			break;
		default:
			/* No Thread device supported ! */
			APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS,
					(uint32_t) ERR_INTERFACE_FATAL);
			break;
		}
		APP_DBG("**********************************************************");
	}
}

/**
 * @brief Handler called when the server receives a COAP request.
 *
 * @param pContext : Context
 * @param pHeader : Header
 * @param pMessage : Message
 * @param pMessageInfo : Message information
 * @retval None
 */

static void APP_THREAD_CoapPermissionsRequestHandler(void *pContext,
		otMessage *pMessage, const otMessageInfo *pMessageInfo)

{
	SHCI_C2_RADIO_AllowLowPower(THREAD_IP, FALSE);
	coapConnectionEstablished = true;
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
	/* USER CODE BEGIN APP_THREAD_CoapRequestHandler */
	//GPIO_PinOutSet(IP_LED_PORT, IP_LED_PIN);
	//printIPv6Addr(&aMessageInfo->mPeerAddr);
	brAddr = pMessageInfo->mPeerAddr;
	otError error = OT_ERROR_NONE;
	otMessage *responseMessage;
	otCoapCode responseCode = OT_COAP_CODE_CHANGED;
	otCoapCode messageCode = otCoapMessageGetCode(pMessage);

