edward62740/ot-HS/Code/HS/STM32_WPAN/App/app_thread.c
	responseMessage = otCoapNewMessage((otInstance*) pContext, NULL);

	otCoapMessageInitResponse(responseMessage, pMessage,
			OT_COAP_TYPE_ACKNOWLEDGMENT, responseCode);
	otCoapMessageSetToken(responseMessage, otCoapMessageGetToken(pMessage),
			otCoapMessageGetTokenLength(pMessage));
	otCoapMessageSetPayloadMarker(responseMessage);

	uint16_t offset = otMessageGetOffset(pMessage);
	otMessageRead(pMessage, offset, resource_name, sizeof(resource_name) - 1);

	if (OT_COAP_CODE_GET == messageCode)
	{

		error = otMessageAppend(responseMessage, "ack", 3);
		error = otCoapSendResponse((otInstance*) pContext, responseMessage,
				pMessageInfo);
	}
	else
	{
		error = otMessageAppend(responseMessage, "nack", 4);
		otCoapMessageSetCode(responseMessage, OT_COAP_CODE_METHOD_NOT_ALLOWED);
		error = otCoapSendResponse((otInstance*) pContext, responseMessage,
				pMessageInfo);
	}

	if (error != OT_ERROR_NONE && responseMessage != NULL)
	{
		otMessageFree(responseMessage);
	}

	SHCI_C2_RADIO_AllowLowPower(THREAD_IP, TRUE);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_RESET);
}

/**
 * @brief This function manages the data response handler.
 *
 * @param pHeader  context
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param result error code
 * @retval None
 */
static void APP_THREAD_CoapDataRespHandler(void *pContext, otMessage *pMessage,
		const otMessageInfo *pMessageInfo, otError result)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(pMessage);
	UNUSED(pMessageInfo);

	if (result == OT_ERROR_NONE)
	{
		APP_DBG("APP_THREAD_CoapDataRespHandler : NO ERROR");
	}
	else
	{
		APP_DBG("APP_THREAD_CoapDataRespHandler : WARNING Result = %d", result);
	}
}

/**
 * @brief Task associated to the push button.
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendCoapMsg(char *buf)
{
	if (!coapConnectionEstablished)
		return;
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
	SHCI_C2_RADIO_AllowLowPower(THREAD_IP, FALSE);

	sht4x_read(&sensor_data.temp_main, &sensor_data.humidity);
	stts22h_temperature_raw_get(&sensor_data.temp_aux);

	int8_t state;
	int8_t ret = app_algo_proc(sensor_data, false, &state);
	if (ret == RES_HEAT)
		sht4x_activate_medium_heater();
	int8_t rssi;
	otThreadGetParentLastRssi(sInstance, &rssi);
	/** CoAP Payload String (max <90 chars) **
	 * device_type (uint8_t): internal use number for indicating sensor type
	 * eui64 (uint32_t): unique id MSB
	 * eui64 (uint32_t): unique id LSB
	 * temp_main (int32_t): radar algo state
	 * humidity (int32_t): radar presence score
	 * temp_aux (int16_t): radar presence distance
	 * rssi (int8_t): last rssi from parent
	 * appCoapSendTxCtr (uint32_t): total CoAP transmissions
	 */
	snprintf(tmp_tx_buf, 254, "%d,%x%x%x%x%x%x%x%x,%ld,%ld,%ld,%d,%ld,%d",
			device_type, eui64[0], eui64[1], eui64[2], eui64[3],
			eui64[4], eui64[5], eui64[6], eui64[7],
			sensor_data.temp_main, sensor_data.humidity, sensor_data.temp_aux,
			rssi, appCoapSendTxCtr++,1800);
	buf = tmp_tx_buf;
	APP_DBG("In appthread handler temp:%d hum:%d temp_aux:%d",
			sensor_data.temp_main, sensor_data.humidity, sensor_data.temp_aux);
	otError error = OT_ERROR_NONE;
	otMessage *message = NULL;
	otMessageInfo messageInfo;
	uint16_t payloadLength = 0;

	// Default parameters
	otCoapType coapType = OT_COAP_TYPE_NON_CONFIRMABLE;
	otIp6Address coapDestinationIp = brAddr;
	message = otCoapNewMessage(NULL, NULL);

	otCoapMessageInit(message, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
	otCoapMessageGenerateToken(message, OT_COAP_DEFAULT_TOKEN_LENGTH);
	error = otCoapMessageAppendUriPathOptions(message, resource_name);

	payloadLength = strlen(buf);

	if (payloadLength > 0)
	{
		error = otCoapMessageSetPayloadMarker(message);

	}

	// Embed content into message if given
	if (payloadLength > 0)
	{
		error = otMessageAppend(message, buf, payloadLength);
	}

	memset(&messageInfo, 0, sizeof(messageInfo));
	messageInfo.mPeerAddr = coapDestinationIp;
	messageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;
	if (coapConnectionEstablished)
	{
		error = otCoapSendRequestWithParameters(NULL, message, &messageInfo,
				NULL,
				NULL,
				NULL);
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_RESET);
	}

	if ((error != OT_ERROR_NONE) && (message != NULL))
	{
		otMessageFree(message);
	}
	sht4x_measure();
	SHCI_C2_RADIO_AllowLowPower(THREAD_IP, TRUE);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_RESET);
}

/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void APP_THREAD_RegisterCmdBuffer(TL_CmdPacket_t *p_buffer)
{
	p_thread_otcmdbuffer = p_buffer;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdPayloadBuffer(void)
{
	return (Thread_OT_Cmd_Request_t*) p_thread_otcmdbuffer->cmdserial.cmd.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdRspPayloadBuffer(void)
{
	return (Thread_OT_Cmd_Request_t*) ((TL_EvtPacket_t*) p_thread_otcmdbuffer)->evtserial.evt.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_NotificationPayloadBuffer(void)
{
	return (Thread_OT_Cmd_Request_t*) (p_thread_notif_M0_to_M4)->evtserial.evt.payload;
}

static void Ot_Cmd_Transfer_Common(void)
{

	/* OpenThread OT command cmdcode range 0x280 .. 0x3DF = 352 */
	p_thread_otcmdbuffer->cmdserial.cmd.cmdcode = 0x280U;
	/* Size = otCmdBuffer->Size (Number of OT cmd arguments : 1 arg = 32bits so multiply by 4 to get size in bytes)
	 * + ID (4 bytes) + Size (4 bytes) */
	uint32_t l_size =
			((Thread_OT_Cmd_Request_t*) (p_thread_otcmdbuffer->cmdserial.cmd.payload))->Size
					* 4U + 8U;
	p_thread_otcmdbuffer->cmdserial.cmd.plen = l_size;

	TL_OT_SendCmd();

	/* Wait completion of cmd */
	Wait_Getting_Ack_From_M0();

}

/**
 * @brief  This function is used to transfer the Ot commands from the
 *         M4 to the M0.
 *
 * @param   None
 * @return  None
 */
void Ot_Cmd_Transfer(void)
{
	Ot_Cmd_Transfer_Common();
}

/**
 * @brief  This function is used to transfer the Ot commands from the
 *         M4 to the M0 with Notification M0 to M4 allowed.
 *
 * @param   None
 * @return  None
 */
void Ot_Cmd_TransferWithNotif(void)
{
	/* Flag to specify to UTIL_SEQ_EvtIdle that M0 to M4 notifications are allowed */
	g_ot_notification_allowed = 1U;

	Ot_Cmd_Transfer_Common();
}

/**
 * @brief  This function is called when acknowledge from OT command is received from the M0+.
 *
 * @param   Otbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_OT_CmdEvtReceived(TL_EvtPacket_t *Otbuffer)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(Otbuffer);

	Receive_Ack_From_M0();

	/* Does not allow OpenThread M0 to M4 notification */
	g_ot_notification_allowed = 0U;
}

/**
 * @brief  This function is called when notification from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_THREAD_NotReceived(TL_EvtPacket_t *Notbuffer)
{
	p_thread_notif_M0_to_M4 = Notbuffer;

